Revit 2027 API
SynchronizeWithCentralOptions.RelinquishUserCreatedWorksets Property
 Indicates whether Revit should relinquish user-created Standard worksets after synchronizing with central.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool RelinquishUserCreatedWorksets { get; }
Public ReadOnly Property RelinquishUserCreatedWorksets As Boolean
	Get
public:
property bool RelinquishUserCreatedWorksets {
	bool get ();
}
member RelinquishUserCreatedWorksets : bool with get
Property Value
Boolean
Remarks
 This is a shortcut to access the value stored in UserWorksets.
See Also
Reference
SynchronizeWithCentralOptions Class
Autodesk.Revit.DB Namespace